tuanlh2k2/BGM220---Siliconlab/soc_empty_client/app.c
/***************************************************************************//**
 * @file
 * @brief Core application logic.
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/
#include <stdbool.h>
#include <math.h>
#include "em_common.h"
#include "app_log.h"
#include "app_assert.h"
#include "sl_bluetooth.h"
#include "gatt_db.h"
#ifdef SL_COMPONENT_CATALOG_PRESENT
#include "sl_component_catalog.h"
#endif // SL_COMPONENT_CATALOG_PRESENT
#ifdef SL_CATALOG_CLI_PRESENT
#include "sl_cli.h"
#endif // SL_CATALOG_CLI_PRESENT
#include "app.h"
#include "mbedtls/error.h"
#include "mbedtls/x509.h"
#include "mbedtls/x509_crt.h"
#include "mbedtls/pk.h"

#if SL_BT_CONFIG_MAX_CONNECTIONS < 1
#error At least 1 connection has to be enabled!
#endif
// Array for holding properties of multiple (parallel) connections
static conn_properties_t conn_properties[SL_BT_CONFIG_MAX_CONNECTIONS];
// Counter of active connections
static uint8_t active_connections_num;
// State of the connection under establishment
// static uint8_t conn_handle = 0xFF;
static conn_state_t conn_state;
// 5d 74 91 ea - a8 f6 - 4b ae - 99 6b - 6e 52 f8 bf 53 50
static const uint8_t secure_attest_service[16] =
{ 0x50, 0x53, 0xbf, 0xf8, 0x52, 0x6e, 0x6b, 0x99, 0xae, 0x4b, 0xf6, 0xa8, 0xea,
		0x91, 0x74, 0x5d };
static const uint8_t characteristic_uuids[nCharacteristics][16] =
{ SERVER_DEVICE_CERT_UUID,
		SERVER_BATCH_CERT_UUID,
		SERVER_FACTORY_CERT_UUID,
		SERVER_ROOT_CERT_UUID,
		CLIENT_CHALLENGE_UUID,
		CLIENT_CHALLENGE_RESPONSE_UUID,
		CLIENT_DEVICE_CERT_UUID,
		CLIENT_BATCH_CERT_UUID,
		CLIENT_FACTORY_CERT_UUID,
		CLIENT_ROOT_CERT_UUID,
		SERVER_CHALLENGE_UUID,
		SERVER_CHALLENGE_RESPONSE_UUID,
		SERVER_ECDH_PUBLIC_KEY_UUID,
		CLIENT_ECDH_PUBLIC_KEY_UUID,
		TEST_DATA_UUID };
static struct secure_attest_data_t secure_attest_data;
static psa_key_id_t server_device_pub_key,
client_ecdh_id,
share_derived_key_id;
static mbedtls_x509_crt cert_chain;
static mbedtls_x509_crt root_trust;
mbedtls_pk_context root_pub_pk;

#ifdef USE_CUSTOM_CERTIFICATES
static const uint8_t server_root_pub_key[] =
		"-----BEGIN PUBLIC KEY-----\n"
		"MFkwEwYHKoZIzj0CAQYIKoZIzj0DAQcDQgAEW/ZeSeQROd7bmPFpDR8rb49rpym/\n"
		"C+4XRCd1soIo4jfpXAnD20eKKaUJ5KSnA7w3qFJQgeU1lp0JPYrlN2bS9Q==\n"
		"-----END PUBLIC KEY-----\n";

#endif
/**************************************************************************//**
 * Private functions declaration
 *****************************************************************************/
static void init_properties(void);

static uint8_t process_scan_response(
		sl_bt_evt_scanner_scan_report_t *p_res);

static uint8_t find_index_by_connection_handle(uint8_t connection);

static void add_connection(uint8_t connection, uint16_t address);

static void remove_connection(uint8_t connection);

static bd_addr *read_and_cache_bluetooth_address(uint8_t *address_type_out);

static void print_bluetooth_address(void);

static void gatt_proc_complete_cb(
		sl_bt_evt_gatt_procedure_completed_t *procedure_completed);

static sl_status_t send_cert(uint8_t connection,
		uint16_t characteristic,
		uint8_t cert_id);

static int verify_callback(void *data,
		mbedtls_x509_crt *crt,
		int depth,
		uint32_t *flags);
/**************************************************************************//**
 * GATT characteristic callback
 *****************************************************************************/
sl_status_t gatt_characteristic_value_dev_cert_cb(
		sl_bt_evt_gatt_characteristic_value_t *value,
		uint8_t table_index);
sl_status_t gatt_characteristic_value_batch_cert_cb(
		sl_bt_evt_gatt_characteristic_value_t *value,
		uint8_t table_index);
sl_status_t gatt_characteristic_value_factory_cert_cb(
		sl_bt_evt_gatt_characteristic_value_t *value,
		uint8_t table_index);
sl_status_t gatt_characteristic_value_root_cert_cb(
		sl_bt_evt_gatt_characteristic_value_t *value,
		uint8_t table_index);
sl_status_t gatt_characteristic_value_challenge_response_cb
(sl_bt_evt_gatt_characteristic_value_t *value,
		uint8_t table_index);
sl_status_t gatt_characteristic_value_server_challenge_cb(
		sl_bt_evt_gatt_characteristic_value_t *value,
		uint8_t table_index);
sl_status_t gatt_characteristic_value_server_ecdh_pub_key_cb(
		sl_bt_evt_gatt_characteristic_value_t *value,
		uint8_t table_index);
sl_status_t gatt_characteristic_value_test_data_cb(
		sl_bt_evt_gatt_characteristic_value_t *value,
		uint8_t table_index);

sl_status_t (*gatt_characteristic_callback[nCharacteristics])(
		sl_bt_evt_gatt_characteristic_value_t *value,
		uint8_t table_index) = {
				gatt_characteristic_value_dev_cert_cb,
				gatt_characteristic_value_batch_cert_cb,
				gatt_characteristic_value_factory_cert_cb,
				gatt_characteristic_value_root_cert_cb,
				NULL,   // characteristic is write-only
				gatt_characteristic_value_challenge_response_cb,

				/* next 4 are client's certificate chain*/
				NULL,   // characteristic is write-only
				NULL,   // characteristic is write-only
				NULL,   // characteristic is write-only
				NULL,   // characteristic is write-only
				gatt_characteristic_value_server_challenge_cb,
				NULL,   // characteristic is write-only
				gatt_characteristic_value_server_ecdh_pub_key_cb,
				NULL,   // characteristic is write-only
				gatt_characteristic_value_test_data_cb
};

/**************************************************************************//**
 * Application Init.
 *****************************************************************************/
void app_init(void)
{
	/////////////////////////////////////////////////////////////////////////////
	// Put your additional application init code here!                         //
	// This is called once during start-up.                                    //
	/////////////////////////////////////////////////////////////////////////////
	sl_status_t sc;

	// Initialize connection properties
	init_properties();
	sc = sl_bt_sm_delete_bondings();
	app_assert_status(sc);

