tuanlh2k2/BGM220---Siliconlab/soc_empty_client/app.c
	memset(&secure_attest_data, 0, sizeof(secure_attest_data));

	mbedtls_pk_init(&root_pub_pk);

	sc = mbedtls_pk_parse_public_key(&root_pub_pk,
			server_root_pub_key,
			sizeof(server_root_pub_key));
	if (sc != SL_STATUS_OK) {
		app_log("mbedtls_pk_parse_public_key(): error %ld\r\n", sc);
	}
}

/**************************************************************************//**
 * Application Process Action.
 *****************************************************************************/
void app_process_action(void)
{
	/////////////////////////////////////////////////////////////////////////////
	// Put your additional application code here!                              //
	// This is called infinitely.                                              //
	// Do not call blocking functions from here!                               //
	/////////////////////////////////////////////////////////////////////////////
}

/**************************************************************************//**
 * Bluetooth stack event handler.
 * This overrides the dummy weak implementation.
 *
 * @param[in] evt Event coming from the Bluetooth stack.
 *****************************************************************************/
void sl_bt_on_event(sl_bt_msg_t *evt)
{
	sl_status_t sc;
	uint16_t addr_value;
	uint8_t table_index = 0;

	// Handle stack events
	switch (SL_BT_MSG_ID(evt->header)) {
	// -------------------------------
	// This event indicates the device has started and the radio is ready.
	// Do not call any stack command before receiving this boot event!
	case sl_bt_evt_system_boot_id:
		// Print boot message.
		app_log_info("Bluetooth stack booted: v%d.%d.%d-b%d\n",
				evt->data.evt_system_boot.major,
				evt->data.evt_system_boot.minor,
				evt->data.evt_system_boot.patch,
				evt->data.evt_system_boot.build);
		// Print bluetooth address.
		print_bluetooth_address();
		// Set passive scanning on 1Mb PHY
		sc = sl_bt_scanner_set_mode(sl_bt_gap_1m_phy, SCAN_PASSIVE);
		app_assert_status(sc);
		// Set scan interval and scan window
		sc = sl_bt_scanner_set_timing(sl_bt_gap_1m_phy, SCAN_INTERVAL, SCAN_WINDOW);
		app_assert_status(sc);
		// Set the default connection parameters for subsequent connections
		sc = sl_bt_connection_set_default_parameters(CONN_INTERVAL_MIN,
				CONN_INTERVAL_MAX,
				CONN_RESPONDER_LATENCY,
				CONN_TIMEOUT,
				CONN_MIN_CE_LENGTH,
				CONN_MAX_CE_LENGTH);
		app_assert_status(sc);
		// Start scanning - looking for thermometer devices
		sc = sl_bt_scanner_start(sl_bt_gap_1m_phy, sl_bt_scanner_discover_generic);
		app_assert_status_f(sc,
				"Failed to start discovery #1\n");
		conn_state = scanning;
		break;

		// -------------------------------
		// This event is generated when an advertisement packet or a scan response
		// is received from a responder
	case sl_bt_evt_scanner_scan_report_id:
		// Parse advertisement packets
		if (evt->data.evt_scanner_scan_report.packet_type == 0) {
			// If a thermometer advertisement is found...
			if (find_service_in_advertisement(&(evt->data.evt_scanner_scan_report.data.data[0]),
					evt->data.evt_scanner_scan_report.data.len) != 0) {
				// then stop scanning for a while
				sc = sl_bt_scanner_stop();
				app_assert_status(sc);
				// and connect to that device
				if (active_connections_num < SL_BT_CONFIG_MAX_CONNECTIONS) {
					sc = sl_bt_connection_open(evt->data.evt_scanner_scan_report.address,
							evt->data.evt_scanner_scan_report.address_type,
							sl_bt_gap_1m_phy,
							NULL);
					app_assert_status(sc);
					conn_state = opening;
				}
			}
		}
		break;

		// -------------------------------
		// This event is generated when a new connection is established
	case sl_bt_evt_connection_opened_id:
		// Get last two bytes of sender address
		app_log("connection opened\r\n");
		app_log("connection opened id with connection handle 0x%02X\r\n",
				evt->data.evt_connection_opened.connection);
		addr_value =
				(uint16_t)(evt->data.evt_connection_opened.address.addr[1] << 8)
				+ evt->data.evt_connection_opened.address.addr[0];
		// Add connection to the connection_properties array
		add_connection(evt->data.evt_connection_opened.connection, addr_value);
		//      sl_bt_sm_increase_security(evt->data.evt_connection_opened.connection);
		sc = sl_bt_connection_set_parameters(
				evt->data.evt_connection_opened.connection,
				24,
				240,
				0,
				3200,
				0,
				0xFFFF);
		app_assert_status(sc);
		break;

		// -------------------------------
		// This event is generated when a new connection is established
	case sl_bt_evt_connection_closed_id:
		app_log("connection closed, reason 0x%2X\r\n",
				evt->data.evt_connection_closed.reason);
		sc = sl_bt_sm_delete_bondings();
		app_assert_status(sc);
		remove_connection(evt->data.evt_connection_opened.connection);
		break;

		// -------------------------------
		// This event is generated when a new service is discovered
	case sl_bt_evt_gatt_service_id:
		table_index = find_index_by_connection_handle(
				evt->data.evt_gatt_service.connection);
		if (table_index != TABLE_INDEX_INVALID) {
			// Save service handle for future reference
			conn_properties[table_index].secure_attest_service_handle =
					evt->data.evt_gatt_service.service;
		}
		break;

		// -------------------------------
		// This event is generated when a new characteristic is discovered
	case sl_bt_evt_gatt_characteristic_id:
		table_index = find_index_by_connection_handle(
				evt->data.evt_gatt_characteristic.connection);
		for (int i = 0; i < nCharacteristics; i++) {
			if (memcmp(evt->data.evt_gatt_characteristic.uuid.data, characteristic_uuids[i], 16) == 0) {
				conn_properties[table_index].characteristic_handles[i] = evt->data.evt_gatt_characteristic.characteristic;
				break;
			}
		}
		break;

		// -------------------------------
		// This event is generated for various procedure completions, e.g. when a
		// write procedure is completed, or service discovery is completed
	case sl_bt_evt_gatt_procedure_completed_id:
		app_assert(evt->data.evt_gatt_procedure_completed.result == SL_STATUS_OK,
				"GATT procedure completed with error 0x%02X\r\n",
				evt->data.evt_gatt_procedure_completed.result);
		gatt_proc_complete_cb(&evt->data.evt_gatt_procedure_completed);
		break;

		// -------------------------------
		// This event is generated when a characteristic value was received e.g. an
		//   indication
	case sl_bt_evt_gatt_characteristic_value_id:
	{
		int index = 0;
		table_index = find_index_by_connection_handle(
				evt->data.evt_gatt_characteristic_value.connection);
		uint16_t characteristic =
				evt->data.evt_gatt_characteristic_value.characteristic;
		for (index = 0; index < nCharacteristics; index++) {
			if (characteristic
					== conn_properties[table_index].characteristic_handles[index]) {
				/* check to make sure that the callback pointer is valid
				 * and call the appropriate handler */
				if (gatt_characteristic_callback[index] != NULL) {
					sc = gatt_characteristic_callback[index](
							&evt->data.evt_gatt_characteristic_value,
							table_index);
					app_assert_status(sc);
				}
				break;
			}
		}
		if (index == nCharacteristics) {
			app_log("unhandled characteristic value %d\r\n", characteristic);
		}
		break;
	}

	// -------------------------------
	// This event is generated when RSSI value was measured
	case sl_bt_evt_connection_rssi_id:
		table_index = find_index_by_connection_handle(
				evt->data.evt_connection_rssi.connection);
		if (table_index != TABLE_INDEX_INVALID) {
			conn_properties[table_index].rssi = evt->data.evt_connection_rssi.rssi;
		}
		// Print the values
		// print_values(conn_properties);
		break;

		// -------------------------------
	case sl_bt_evt_connection_phy_status_id:
		break;

		// -------------------------------
	case sl_bt_evt_connection_remote_used_features_id:
		break;

		// -------------------------------
	case sl_bt_evt_sm_bonded_id:
		app_log("sm_bonded event: bond handle %d and security mode %d\r\n",
				evt->data.evt_sm_bonded.bonding,
				evt->data.evt_sm_bonded.security_mode + 1);
		//      init_properties();
		// would it be better to wait for an encrypted connection to do this?
		sc = sl_bt_gatt_discover_primary_services_by_uuid(
				evt->data.evt_sm_bonded.connection,
				sizeof(secure_attest_service),
				secure_attest_service);
		app_assert_status(sc);
		conn_state = discover_services;
		break;

		// -------------------------------
	default:
		app_log_debug("unhandled event 0x%lX\r\n",
				SL_BT_MSG_ID(evt->header));
		break;
	}
}

/**************************************************************************//**
 *
 *****************************************************************************/
sl_status_t gatt_characteristic_value_dev_cert_cb(
		sl_bt_evt_gatt_characteristic_value_t *value,
		uint8_t table_index)
{
	if ((value->value.len + value->offset)
			> sizeof(secure_attest_data.device_certificate_buffer)) {
		return SL_STATUS_WOULD_OVERFLOW;
	}
	if (value->characteristic
			== conn_properties[table_index].characteristic_handles[device_certificate])
	{
		memcpy(&secure_attest_data.device_certificate_buffer[value->offset],
				value->value.data,
				value->value.len);
		secure_attest_data.device_cert_actual_size += value->value.len;
	}
	return SL_STATUS_OK;
}

sl_status_t gatt_characteristic_value_batch_cert_cb(
		sl_bt_evt_gatt_characteristic_value_t *value,
		uint8_t table_index)
{
	// app_log("got %d bytes of the server's batch cert\r\n", value->value.len);
	if ((value->value.len + value->offset)
			> sizeof(secure_attest_data.batch_certificate_buffer)) {
		return SL_STATUS_WOULD_OVERFLOW;
	}
	if (value->characteristic
			== conn_properties[table_index].characteristic_handles[batch_certificate])
	{
		memcpy(&secure_attest_data.batch_certificate_buffer[value->offset],
				value->value.data,
				value->value.len);
		secure_attest_data.batch_cert_actual_size += value->value.len;
	}
	return SL_STATUS_OK;
}

sl_status_t gatt_characteristic_value_factory_cert_cb(
		sl_bt_evt_gatt_characteristic_value_t *value,
		uint8_t table_index)
{
	// app_log("got %d bytes of the server's factory cert\r\n", value->value.len);
	if ((value->value.len + value->offset)
			> sizeof(secure_attest_data.factory_certificate_buffer)) {
		return SL_STATUS_WOULD_OVERFLOW;
	}
	if (value->characteristic
			== conn_properties[table_index].characteristic_handles[
																   factory_certificate]) {
		memcpy(&secure_attest_data.factory_certificate_buffer[value->offset],
				value->value.data,
				value->value.len);
		secure_attest_data.factory_cert_actual_size += value->value.len;
	}
	return SL_STATUS_OK;
}

sl_status_t gatt_characteristic_value_root_cert_cb(
		sl_bt_evt_gatt_characteristic_value_t *value,
		uint8_t table_index)
{
	if ((value->value.len + value->offset)
			> sizeof(secure_attest_data.root_certificate_buffer)) {
		return SL_STATUS_WOULD_OVERFLOW;
	}
	if (value->characteristic
			== conn_properties[table_index].characteristic_handles[root_certificate])
	{
		memcpy(&secure_attest_data.root_certificate_buffer[value->offset],
				value->value.data,
				value->value.len);
		secure_attest_data.root_cert_actual_size += value->value.len;
	}
	return SL_STATUS_OK;
}

sl_status_t gatt_characteristic_value_challenge_response_cb(
		sl_bt_evt_gatt_characteristic_value_t *value,
		uint8_t table_index)
{
	if (value->value.len > sizeof(secure_attest_data.response)) {
		return SL_STATUS_WOULD_OVERFLOW;
	}
	if (value->characteristic
			== conn_properties[table_index].characteristic_handles[challenge_response])
	{
		// the response *should* come in a single packet
		app_log("saving challenge response from server\r\n");
		memcpy(&secure_attest_data.response[value->offset],
				value->value.data,
				value->value.len);
	}
	return SL_STATUS_OK;
}

sl_status_t gatt_characteristic_value_test_data_cb(
		sl_bt_evt_gatt_characteristic_value_t *value,
		uint8_t table_index)
{
	sl_status_t sc = SL_STATUS_OK;
	if (value->characteristic
			== conn_properties[table_index].characteristic_handles[test_data]) {
		uint8_t plaintext[16], ciphertext[32], additional[16], nonce[13];
		psa_algorithm_t alg = PSA_ALG_CCM;
		size_t bytes_decrypted;
		uint8_t *p = value->value.data;

		/* check that there is sufficient room for ciphertext and nonce */
		if (value->value.len > (sizeof(ciphertext) + sizeof(nonce))) {
			return SL_STATUS_WOULD_OVERFLOW;
		}
		memcpy(nonce, p, sizeof(nonce));
		memcpy(ciphertext,
				p + sizeof(nonce),
				value->value.len - sizeof(nonce));
		sc = psa_aead_decrypt(share_derived_key_id, alg,
				nonce, sizeof(nonce),
				additional, 0,
				ciphertext, value->value.len - sizeof(nonce),
				plaintext, sizeof(plaintext),
				&bytes_decrypted);

