tuanlh2k2/BGM220---Siliconlab/soc_empty_client/app.c
		app_assert_status(sc);
		app_log("Decrypted the following message %s\r\n", plaintext);
	}
	return sc;
}

sl_status_t gatt_characteristic_value_server_challenge_cb(
		sl_bt_evt_gatt_characteristic_value_t *value,
		uint8_t table_index)
{
	sl_status_t status = SL_STATUS_IN_PROGRESS;
	uint8_t challenge[16], response[64];
	if (value->value.len > sizeof(challenge)) {
		return SL_STATUS_WOULD_OVERFLOW;
	}
	app_log("got a random challenge from the server\r\n");
	if (value->characteristic
			== conn_properties[table_index].characteristic_handles[server_challenge])
	{
		uint16_t response_handle =
				conn_properties[table_index].characteristic_handles[
																	server_challenge_response];
		memcpy(challenge, value->value.data,
				value->value.len);
		app_log("signing challenge\r\n");

		/*if signing fails for any reason then return before sending the response*/
		if (status) {
			return status;
		}
		if (conn_state == challenge_notification_enabled) {
			app_log("sending challenge response to server\r\n");
			status = sl_bt_gatt_write_characteristic_value(value->connection,
					response_handle,
					sizeof(response),
					response);
			if (status) {
				app_log("error sending challenge response to server %ld\r\n", status);
			}
			conn_state = send_challenge_response;
		} else {
			app_log(
					"received a challenge from server, but the subscription operation hasn't completed yet\r\n");
		}
	}
	return status;
}

/**************************************************************************//**
 * Init connection properties
 *****************************************************************************/
static void init_properties(void)
{
	uint8_t i;
	active_connections_num = 0;

	for (i = 0; i < SL_BT_CONFIG_MAX_CONNECTIONS; i++) {
		conn_properties[i].connection_handle = CONNECTION_HANDLE_INVALID;
		conn_properties[i].secure_attest_service_handle = SERVICE_HANDLE_INVALID;
		for (int j = 0; j < nCharacteristics; j++) {
			conn_properties[i].characteristic_handles[j] =
					CHARACTERISTIC_HANDLE_INVALID;
		}
		conn_properties[i].temperature = TEMP_INVALID;
		conn_properties[i].unit = UNIT_INVALID;
		conn_properties[i].rssi = RSSI_INVALID;
	}
}

// Parse advertisements looking for advertised service
static uint8_t process_scan_response(
		sl_bt_evt_scanner_scan_report_t *p_res)
{
	uint8_t ad_length;
	uint8_t ad_type;
	uint8_t i = 0;
	char name[32];
	bool device_found = false;
	// Parse advertisement packet
	while (i < p_res->data.len - 1) {
		ad_length = p_res->data.data[i];
		ad_type = p_res->data.data[i + 1];

		// Type 0x08 = Shortened Local Name
		// Type 0x09 = Complete Local Name
		if ((ad_type == 0x08) || (ad_type == 0x09)) {
			memcpy(name, &(p_res->data.data[i + 2]), ad_length - 1);
			name[ad_length - 1] = 0;
			app_log("%s\r\n", name);
		}

		// Type 0x06 = Incomplete List of 128-bit Service Class UUIDs
		// Type 0x07 = Complete List of 128-bit Service Class UUIDs
		if ((ad_type == 0x06) || (ad_type == 0x07)) {
			if (memcmp(secure_attest_service, &(p_res->data.data[i + 2]), 16) == 0) {
				app_log("found device \r\n");
				device_found = true;
			}
		}
		// advance to the next AD struct
		i = i + ad_length + 1;
	}
	return device_found;
}

// Find the index of a given connection in the connection_properties array
static uint8_t find_index_by_connection_handle(uint8_t connection)
{
	for (uint8_t i = 0; i < active_connections_num; i++) {
		if (conn_properties[i].connection_handle == connection) {
			return i;
		}
	}
	return TABLE_INDEX_INVALID;
}

// Add a new connection to the connection_properties array
static void add_connection(uint8_t connection, uint16_t address)
{
	conn_properties[active_connections_num].connection_handle = connection;
	conn_properties[active_connections_num].server_address = address;
	active_connections_num++;
}

// Remove a connection from the connection_properties array
static void remove_connection(uint8_t connection)
{
	uint8_t i;
	uint8_t table_index = find_index_by_connection_handle(connection);

	if (active_connections_num > 0) {
		active_connections_num--;
	}
	// Shift entries after the removed connection toward 0 index
	for (i = table_index; i < active_connections_num; i++) {
		conn_properties[i] = conn_properties[i + 1];
	}
	// Clear the slots we've just removed so no junk values appear
	for (i = active_connections_num; i < SL_BT_CONFIG_MAX_CONNECTIONS; i++) {
		conn_properties[i].connection_handle = CONNECTION_HANDLE_INVALID;
		conn_properties[i].secure_attest_service_handle = SERVICE_HANDLE_INVALID;
		for (int j = 0; j < 4; j++) {
			conn_properties[i].characteristic_handles[j] =
					CHARACTERISTIC_HANDLE_INVALID;
		}
		conn_properties[i].temperature = TEMP_INVALID;
		conn_properties[i].unit = UNIT_INVALID;
		conn_properties[i].rssi = RSSI_INVALID;
	}
}

/**************************************************************************//**
 * @brief
 *   Function to Read and Cache Bluetooth Address.
 * @param address_type_out [out]
 *   A pointer to the outgoing address_type. This pointer can be NULL.
 * @return
 *   Pointer to the cached Bluetooth Address
 *****************************************************************************/
static bd_addr *read_and_cache_bluetooth_address(uint8_t *address_type_out)
{
	static bd_addr address;
	static uint8_t address_type;
	static bool cached = false;

	if (!cached) {
		sl_status_t sc = sl_bt_system_get_identity_address(&address, &address_type);
		app_assert_status(sc);
		cached = true;
	}

	if (address_type_out) {
		*address_type_out = address_type;
	}

	return &address;
}

/**************************************************************************//**
 *   Function to Print Bluetooth Address.
 *****************************************************************************/
static void print_bluetooth_address(void)
{
	uint8_t address_type;
	bd_addr *address = read_and_cache_bluetooth_address(&address_type);

	app_log("Bluetooth %s address: %02X:%02X:%02X:%02X:%02X:%02X\r\n",
			address_type ? "static random" : "public device",
					address->addr[5],
					address->addr[4],
					address->addr[3],
					address->addr[2],
					address->addr[1],
					address->addr[0]);
}

/**************************************************************************
 *    GATT procedure completed callback
 ***************************************************************************/
void gatt_proc_complete_cb(
		sl_bt_evt_gatt_procedure_completed_t *procedure_completed)
{
	uint8_t table_index;
	static sl_status_t sc;
	uint32_t flags = 1;

	table_index = find_index_by_connection_handle(procedure_completed->connection);
	if (table_index == TABLE_INDEX_INVALID) {
		return;
	}

