tuanlh2k2/BGM220---Siliconlab/soc_empty_client/app.c
	if (conn_properties[table_index].secure_attest_service_handle != SERVICE_HANDLE_INVALID) {
		switch (conn_state) {
		case discover_services:
			sc = sl_bt_gatt_discover_characteristics(
					procedure_completed->connection,
					conn_properties[table_index].secure_attest_service_handle);
			app_assert_status(sc);
			conn_state = discover_characteristics;
			break;

		case discover_characteristics:
			sc = sl_bt_gatt_read_characteristic_value(
					procedure_completed->connection,
					conn_properties[table_index].characteristic_handles[device_certificate]);
			app_assert_status(sc);
			conn_state = read_device_cert;
			break;

		case read_device_cert:
			sl_bt_scanner_stop();
			sc = sl_bt_gatt_read_characteristic_value(
					procedure_completed->connection,
					conn_properties[table_index].characteristic_handles[
																		batch_certificate]);
			app_assert_status(sc);
			conn_state = read_batch_cert;
			break;

		case read_batch_cert:
			sc = sl_bt_gatt_read_characteristic_value(
					procedure_completed->connection,
					conn_properties[table_index].characteristic_handles[
																		factory_certificate]);
			app_assert_status(sc);
			conn_state = read_factory_cert;
			break;

		case read_factory_cert:
			sc = sl_bt_gatt_read_characteristic_value(
					procedure_completed->connection,
					conn_properties[table_index].characteristic_handles[
																		root_certificate]);
			app_assert_status(sc);
			conn_state = read_root_cert;
			break;

		case read_root_cert:
			app_log("Received secure identity certificate chain from server\r\n");
			if (sc == SL_STATUS_OK) {
				/*generate a random number and get the remote device to sign it*/

				app_log("\r" "sending challenge to server\r\n");
				sl_bt_gatt_write_characteristic_value(
						procedure_completed->connection, conn_properties[
																		 table_index].characteristic_handles[challenge],
																		 sizeof(secure_attest_data.challenge),
																		 secure_attest_data.challenge);
				app_assert_status(sc);
				conn_state = send_challenge;
			} else {
				app_log(
						"certificate chain verification failed ... closing connection\r\n");
				sl_bt_connection_close(conn_properties[table_index].connection_handle);
			}
			conn_state = send_challenge;
			break;

		case send_challenge:
			sc = sl_bt_gatt_read_characteristic_value(
					procedure_completed->connection,
					conn_properties[table_index].characteristic_handles[
																		challenge_response]);
			app_assert_status(sc);
			conn_state = wait_challenge_response;
			break;

		break;
		case send_factory_cert:
		{
			if (sc == SL_STATUS_IS_WAITING) {
				sc = send_cert(
						procedure_completed->connection,
						conn_properties[table_index].characteristic_handles[
																			local_factory_certificate],
																			FACTORY_CERT_ID /*factory cert goes here*/);
			} else if (sc == SL_STATUS_OK) {
				sc = send_cert(
						procedure_completed->connection,
						conn_properties[table_index].characteristic_handles[
																			local_root_certificate],
																			ROOT_CERT_ID /*root cert goes here*/);
				conn_state = send_root_cert;
			}
		}
		break;
		case send_root_cert:
		{
			if (sc == SL_STATUS_IS_WAITING) {
				sc = send_cert(
						procedure_completed->connection,
						conn_properties[table_index].characteristic_handles[
																			local_root_certificate],
																			ROOT_CERT_ID /*root cert goes here*/);
			} else if (sc == SL_STATUS_OK) {
				uint16_t server_challenge_characteristic =
						conn_properties[table_index].characteristic_handles[
																			server_challenge];
				if (server_challenge_characteristic
						!= CHARACTERISTIC_HANDLE_INVALID) {
					sc = sl_bt_gatt_set_characteristic_notification(
							procedure_completed->connection,
							server_challenge_characteristic,
							sl_bt_gatt_notification);
					if (sc) {
						app_log("error subscribing to challenge notifications\r\n");
					}
				}
				conn_state = challenge_notification_enabled;
			}
		}
		break;
		case challenge_notification_enabled:
			/*need to wait until previous operation completes before sending
			 *   challenge response*/
			break;

		case send_challenge_response:
		{
			uint16_t server_challenge_characteristic =
					conn_properties[table_index].characteristic_handles[server_challenge];

			/*turn off notifications since we don't need them anymore*/
			sl_bt_gatt_set_characteristic_notification(
					procedure_completed->connection,
					server_challenge_characteristic,
					sl_bt_gatt_disable);
			conn_state = read_server_ecdh_public_key;
		}
		break;
		case read_server_ecdh_public_key:
			app_log("reading server ECDH key\r\n");
			sl_bt_gatt_read_characteristic_value(
					procedure_completed->connection,
					conn_properties[table_index].characteristic_handles[
																		server_ecdh_pub_key]);
			conn_state = send_client_ecdh_public_key;
			break;
		case send_client_ecdh_public_key:
		{
			sl_status_t sc;

			app_log("client signing ECDH key\r\n");
			app_assert_status(sc);
			//sc = sl_bt_gatt_write_characteristic_value(
			//		procedure_completed->connection,
			//		conn_properties[table_index].characteristic_handles[client_ecdh_pub_key],
			//															sizeof(client_key),
			//															(const uint8_t *) &client_key);
			//app_assert_status(sc);
		//	app_log("client finalizing key agreement\r\n");


			conn_state = running;
		}
		break;
		case running:
			sc = sl_bt_gatt_read_characteristic_value(
					procedure_completed->connection,
					conn_properties[
									table_index].characteristic_handles[test_data]);
			app_assert_status(sc);
			conn_state = idle;
			break;
		case opening:
		case wait_for_challenge:
		case idle:
		default:
			break;
		}
	}
}

/**************************************************************************
 *    Send a certificate to a remote device
 ***************************************************************************/
sl_status_t send_cert(uint8_t connection,
		uint16_t characteristic,
		uint8_t cert_id)
{
	static uint8_t cert_buffer[768];
	uint8_t send_buffer[255];
	static size_t cert_size = 0;
	sl_status_t status, write_status;

	write_status = sl_bt_gatt_write_characteristic_value(connection,
			characteristic,
			1,
			send_buffer);
	return status;
}

/* end of file */
